{
	"speaker": [
		{
			"name": "Rich Harris",
			"title": "SvelteKit status update",
			"slug": "sveltekit-status-update",
			"twitter": ["rich_harris"],
			"image": "rich.jpeg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>We're almost there!</p>"
		},
		{
			"name": "Amelia Wattenberg & Russel Goldenberg",
			"title": "Declarative Data Visualization: Creating a bar chart race",
			"slug": "declarativec-data-visualization",
			"twitter": ["wattenberger", "codenberg"],
			"image": "amelia_russel.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>We'll create a recently popularized data visualization: the bar chart race! As we build, we'll discuss the benefits of using Svelte and how it compares to a pure d3 implementation. We'll cover lots of interesting techniques, like rendering with SVG & HTML, easy-to-maintain transitions, and componentizing chart parts!</p>"
		},
		{
			"name": "Ron Au",
			"title": "Zwoosh YEAHHH Shabam! 🤯 Whimsy in motion",
			"slug": "zwoosh-yeahhh-shabam-whimsy-in-motion",
			"twitter": ["ronvoluted"],
			"image": "ron_au.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>You've seen it on Dribbble, you've seen it on Disney. With a pop and a wiggle you can add some whimsy. Buckle your seat belt and pull up your socks. With good old Svelte we're animating out of the box!</p>"
		},
		{
			"name": "Martin McKeaveney",
			"title": "Building the Next Generation of Low Code with Svelte",
			"slug": "building-the-next-generation-of-low-code",
			"twitter": ["shogun_purple"],
			"image": "martin_mck.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>A dive into budibase - an open source low code platform for building internal tools on your own infrastructure in minutes.</p><p>The platform relies heavily on svelte and this talk will detail how we leverage svelte within budibase to produce lightweight, incredibly performant applications with a low code tool.</p>"
		},
		{
			"name": "Eirik Vågeskar & Gløer Olav Langslet",
			"title": "Generation Svelte – Our textbook will make Svelte the first language for Norwegian high schoolers",
			"slug": "generation-svelte-textbook",
			"twitter": ["gloerolav"],
			"image": "gloer.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>In this talk, Gløer Langslet and Eirik Vågeskar explain why we need to make programming fun again. Eirik will tell the story of when he learned to program -- using Adobe Flash in high school, with Gløer as his teacher. The two reconnected ten years later over their love of Svelte -- and convinced Norway's largest text book publisher, Cappelen Damm, to use Svelte to teach programming to the next generation of high schoolers. The talk will show interactive examples from their upcoming book.</p><p>Making programming fun and lowering the barrier to entry is an important step in getting enough programmers to meet demand in the near future. First impressions are important, and Svelte is sure to impress.</p>"
		},
		{
			"name": "Fred Schott",
			"title": "Svelte without the JavaScript",
			"slug": "svelte-without-the-javascript",
			"twitter": ["FredKSchott"],
			"image": "fred_schott.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>If Svelte runs on a server and no one is around to see it, does it still make a sound?</p><p>CSR, SSR, SSG... There are seemingly hundreds of different ways to serve your site in production, each with different tradeoffs to consider. In this talk, Fred explores the world of server-side optimization: what's possible today and what comes next?</p>"
		},
		{
			"name": "Alex Cabrera",
			"title": "Interactive Data Science Widgets with Svelte and Jupyter",
			"slug": "interactive-data-science-widgets-with-svelte-and-jupyter",
			"twitter": ["a_a_cabrera"],
			"image": "alex_cabrera.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>Jupyter notebooks are one of the most popular platforms for data science and machine learning. Notebooks support interactive widgets which let users better visualize and interact with their data and code. While widgets are traditionally difficult to create, it is now possible to easily make Jupyter Widgets (or port existing apps) using Svelte. In this talk, we walk through how to create interactive data science widgets with Jupyter and Svelte.</p>"
		},
		{
			"name": "Miguel Camba",
			"title": "Svelte can compile and so can you",
			"slug": "svelte-can-compile-and-so-can-you",
			"twitter": ["MiguelCamba"],
			"image": "miguel_camba.png",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>Svelte's unique approach of acting as a compiler for web apps has proven to be groundbreaking in several ways.</p><p>Instead of being a runtime framework that evaluates your code in the client, Svelte analyzes and understands your code ahead of time to ship the smallest and fastest bundle possible with nothing but what you use.</p><p>That revelation sparked an idea on me. What if we applied the same principles to other facets of app development? Are there other pieces of apps that can be analyzed ahead of time to optimize it further.</p><p>It turns out the answer is yes, and I created https://github.com/cibernox/rollup-plugin-precompile-intl to demonstrate it.</p>"
		},
		{
			"name": "Rodrigo Frenk",
			"title": "Design Ñgineering: Writing a Design System in Spanish for our team in Mexican cultural public sector",
			"slug": "design-engineering-writing-a-design-system-in-spanish",
			"twitter": ["furenku"],
			"image": "rodrigo_furenku.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>Our workplace, Centro de Cultura Digital (a progressive state-run center for technology-based cultural agents - centroculturadigital.mx), has always had very high design standards. The nature of public service and institutional commitments has required us to keep a very demanding schedule, creating multiple webapps in parallel alongside revamping legacy projects, and doing consulting work to help multiple institutions develop viable solutions with none or small development teams. Tasked with balancing of all these factors, and with creating a sustainable future ecosystem, we decided to develop our Design System, choosing our native language to allow for future developers to easily deliver high-quality design projects inside the Mexican public sector. We take great efforts to develop a Spanish-speaking technological language.</p>"
		},
		{
			"name": "Jamie Birch",
			"title": "Svelte NodeGUI (and How to Build a Custom Svelte Renderer)",
			"slug": "svelte-nodegui-and-how-to-build-a-custom-svelte-renderer",
			"twitter": ["LinguaBrowse"],
			"image": "jamie_birch.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>NodeGUI is a library that brings a Qt-based GUI to Node.js. Supporting macOS, Windows, and Linux, it serves as a framework for developing cross-platform desktop applications, while still using familiar web concepts such as Flexbox layout and CSS styling. And unlike the state-of-the-art framework, Electron, NodeGUI is lightweight, as it renders a native UI rather than hosting its UI in a web browser.</p><p>Svelte NodeGUI takes the project further by implementing a Svelte renderer for NodeGUI, abstracting away much of the learning curve of Qt and allowing you to write a NodeGUI app with about as easily as if you were writing a web app!</p>"
		},
		{
			"name": "Francisco Bernardo",
			"title": "A signal engine for audio and music in your Svelte app",
			"slug": "signal-engine-for-audio-and-music",
			"twitter": ["frantic0"],
			"image": "francisco_be.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>The sema-engine library (https://bit.ly/3dh3cEU) provides a high-performance audio engine for modern Web applications, with an easy-to-use API that has been previously used in the making of Svelte-based apps. It uses the Web Audio API Audio Worklet and Maximilian DSP C++ library to render audio in a dedicated thread. This lightning talk will cover the basics of setting up and usage of the sema-engine with Svelte-based apps for music and sound control.</p>"
		},
		{
			"name": "Dmitry Vinnik",
			"title": "Testing Svelte with Jest: Validate Your Components Quickly!",
			"slug": "testing-svelte-with-jest",
			"twitter": ["DmitryVinnik"],
			"image": "dmitry_vinnik.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>How confident are you in your Svelte app? Does your UI render after you add a new item to the nav menu? What about style changes - do you know how a font change affects the rest of your app?</p><p>If you want to have confidence in your Svelte app, you need to have tests. Unfortunately, most testing frameworks are hard to set up, and it takes too long to run them. But this is not the case with Jest!</p>"
		},
		{
			"name": "Stephane Vanraes",
			"title": "Optimizing your Svelte Community Experience",
			"slug": "optimizing-your-svelte-community-experience",
			"twitter": ["StephaneVanraes"],
			"image": "stephane_vanraes.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>Getting stuck while working with Svelte is never nice, but where and how do you get the help you need, especially in a community that is fully volunteer driven ?</p><p>I will take you through the several venues for bugs, general questions and specific use cases as well as how to best prepare your issue to get quick and precise answers without alienating other users.</p>"
		},
		{
			"name": "Anthony Le Goas",
			"title": "Compile for accessibility with Svelte",
			"slug": "compile-for-accessibility",
			"twitter": ["anthony_legoas"],
			"image": "anthony_le.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>What if your favorite frontend framework could (really) help you create accessible web applications?</p><p>A sweet dream, no? Well, don't dream anymore because Svelte integrates checks on good accessibility practices directly in its compiler. Let's figure out together how this is done, the benefits and the limits.</p>"
		},
		{
			"name": "Tane Piper",
			"title": "Reactive Forms with Svelte",
			"slug": "reactive-forms-with-svelte",
			"twitter": ["tanepiper"],
			"image": "Tane_Piper.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>Learn about Formula - a library for Svelte designed for building fully reactive data-driven applications with HTML5 forms, Svelte Actions and Stores.</p>"
		},
		{
			"name": "Isaac Hagoel",
			"title": "Untangling Composition and Higher Order Components",
			"slug": "untangling-composition",
			"twitter": ["isaac_hagoel"],
			"image": "Isaac_Hagoel.jpg",
			"video": "https://www.youtube.com/embed/qSfdtmcZ4d0",
			"content": "<p>A short yet deep dive into higher order components in Svelte. We will learn what higher order components are and see two distinct patterns for implementing them in svelte: slots and svelte:component. We will discuss some tradeoffs, gotchas and insights gained from a year of using svelte in production</p><p>Special thanks to Thomas Dune for his help in making this</p>"
		}
	],
	"sponsors": [
		{
			"type": "silver",
			"url": "https://www.humancontent.nl",
			"name": "Human Content",
			"description": "Whether it is a website, a business application or a mobile app; we take care of the entire process, from the first consultation to an end product with maximum added value for the customer and end users.",
			"image": "humancontent.svg"
		},
		{
			"type": "silver",
			"name": "Oasis Digital",
			"url": "https://oasisdigital.com",
			"description": "Oasis Digital delivers advanced software product development and training services, focused on web technology and full stack solutions.",
			"image": "oasis.svg"
		},
		{
			"type": "silver",
			"name": "Hyper 63",
			"url": "https://hyper63.com",
			"description": "A different approach to software development by improving the process of development for developers to speed up innovation",
			"image": "hyper63.svg"
		},
		{
			"url": "https://www.coderight.se",
			"type": "gold",
			"name": "b3 coderight",
			"description": "We develop innovative and secure digital experiences, websites, integrations and systems.",
			"image": "b3coderight.svg"
		},
		{
			"type": "gold",
			"name": "AWS Amplify",
			"url": "https://aws.amazon.com/amplify/",
			"image": "aws.svg",
			"description": "AWS Amplify – The fastest, easiest way to develop mobile and web apps that scale"
		}
	]
}
