{
  "speaker": [
    {
      "name": "Luke Edwards",
      "title": "Svelte at the Edge: Powering Svelte Apps with Cloudflare Workers",
      "twitter": "lukeed05",
      "slug": "svelte-at-the-edge-using-cloudflare-workers",
      "image": "lukeed.jpeg",
      "content": "<p>Will Svelte run inside a Cloudflare Worker? What are the benefits? Are there trade-offs? Can we make this easier?</p>"
    },
    {
      "name": "Nick Reese",
      "title": "Building SEO Friendly Sites with Svelte and Elder.js",
      "twitter": "nickreese",
      "slug": "building-seo-friendly-sites-with-svelte-and-elderjs",
      "image": "nick.jpeg",
      "content": "<p>Svelte makes interactivity a breeze but building SEO focused websites with Svelte isn't as easy as it seems.</p><p>In this talk we'll explore how you can use Svelte and Elder.js to build flagship SEO sites. We'll cover routing, partial hydration, hooks, and shortcodes so you can hit the ground running.</p>"
    },
    {
      "name": "Peter Allen",
      "title": "REPLicant",
      "slug": "replicant",
      "twitter": "evilpingwin",
      "image": "peter.png",
      "content": "<p>A REPL, or online playground, is a great way to allow users to test-drive tools you have built without needing to install a thing, but they are also great for interactive tutorials, sharing snippets and reporting bugs!</p><p>The Svelte REPL has been a feature of the svelte ecosystem since time immemorial and while REPLs can be complex, the principles are simple when you know them.</p><p>We will take a dive into how the Svelte REPL works and build the simplest possible version. LIVE!</p>"
    },
    {
      "name": "Kirill Vasiltsov",
      "title": "Unlocking The Power of Svelte Actions",
      "slug": "unlocking-the-power-of-svelte-actions",
      "image": "kirill.jpg",
      "content": "<p>Learn how to make development easier with Svelte actions.<br>Create custom events, extend DOM attributes, share animation logic and<br>more.</p>",
      "twitter": "virtualkirill"
    },
    {
      "name": "Morgan Williams",
      "title": "The Zen of Svelte",
      "slug": "the-zen-of-svelte",
      "image": "morgan.jpg",
      "content": "<p>Approaching frontend as a backend developer, Svelte feels surprisingly pythonic. Let's take a quick look at what's familiar, what's foreign, and how to explore the gap.</p>",
      "twitter": "mrgnw"
    },
    {
      "name": "Dominik G",
      "title": "Introduction to Svite",
      "slug": "introduction-to-svite",
      "image": "svite.svg",
      "content": "<p>An Introduction to svite and demonstration of its features:</p><ul><li><p>easy setup with cli</p></li><li><p>ultra fast hot-module-reloading</p></li><li><p>optimized production build</p></li></ul>"
    }
  ],
  "sponsors": [
    {
      "type": "silver",
      "url": "https://www.humancontent.nl",
      "name": "Human Content",
      "description": "Whether it is a website, a business application or a mobile app; we take care of the entire process, from the first consultation to an end product with maximum added value for the customer and end users.",
      "image": "humancontent.svg"
    },
    {
      "type": "silver",
      "name": "Oasis Digital",
      "url": "https://oasisdigital.com",
      "description": "Oasis Digital delivers advanced software product development and training services, focused on web technology and full stack solutions.",
      "image": "oasis.svg"
    },
    {
      "type": "silver",
      "name": "Hyper 63",
      "url": "https://hyper63.com",
      "description": "A different approach to software development by improving the process of development for developers to speed up innovation",
      "image": "hyper63.svg"
    },
    {
      "url": "https://www.coderight.se",
      "type": "gold",
      "name": "b3 coderight",
      "description": "We develop innovative and secure digital experiences, websites, integrations and systems.",
      "image": "b3coderight.svg"
    },
    {
      "type": "gold",
      "name": "AWS Amplify",
      "url": "https://aws.amazon.com/amplify/",
      "image": "aws.svg",
      "description": "AWS Amplify – The fastest, easiest way to develop mobile and web apps that scale"
    }
  ]
}